package Mentor.mentor5;

import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class task2 {

//    String text = "Мова значно запозичила синтаксис 0979999999із C і C++. " +
//            "Зокрема, взято за основу об'єктну модель С++, проте " +
//            "її модифіковано. Усунуто можливіс+380660112233ть " +
//            "появи деяких конфліктних ситуацій, що могли виникнути через помилки " +
//            "прогр+38045654645аміста та полегшено сам процес розробки об'єктно-орієнтованих ";
// в блоке текста найти украинские телефонные номера и вывести на экран

    public static void main(String[] args) {

        final String string = "Мова значно запозичила синтаксис 0979999999із C і C++. \" +\n"
                + "                \"Зокрема, взято за основу об'єктну модель С++, проте \" +\n"
                + "                \"її модифіковано. Усунуто можливіс+380660112233ть \" +\n"
                + "                \"появи деяких конфліктних ситуацій, що могли виникнути через помилки \" +\n"
                + "                \"прогр+38045654645аміста та полегшено сам процес розробки об'єктно-орієнтованих";

        final Pattern pattern = Pattern.compile("(\\+380|0)\\d{9}");
        final Matcher matcher = pattern.matcher(string);
        
        while (matcher.find()) {
            System.out.println(matcher.group());
        }
    }

}
